# read design
read -sv src/control_machine.v
hierarchy -top control_machine

# the high-level stuff
proc; fsm; opt; memory; techmap; opt

# opens a window with the RTL diagram
# show -format ps -viewer gv

# generate verilog optimized code
write_verilog sim/src/control_machine.v

# cleanup
clean
