# read design
read -sv src/d_slp_counter.v
hierarchy -top d_slp_counter

# the high-level stuff
proc; fsm; opt; memory; techmap; opt

# opens a window with the RTL diagram
# show -format ps -viewer feh

# generate verilog optimized code
write_verilog sim/src/d_slp_counter.v

# cleanup
clean
