# read design
read -sv src/d_slp_counter.v
hierarchy -top d_slp_counter

# the high-level stuff
proc; opt

# opens a window with the RTL diagram
show -format ps -viewer gv

# generate verilog optimized code
#write_verilog sim/src/d_slp_counter.v

# cleanup
clean
